app/controllers/admin_controller.rb

SELECT "users".* FROM "users" WHERE "users"."username" = 'Gerard' LIMIT 1
---
  def check_login

    if User.where({ :username => params[:username] }).first