app/controllers/family_controller.rb

SELECT "families".* FROM "families" ORDER BY parent_last_name ASC, parent_first_name ASC
---
  def index
  #Viewing all Families; call edit/delete from this screen
    @families = Family.order("parent_last_name ASC, parent_first_name ASC")

INSERT INTO "families" ("cell_phone", "chaperone_first_name", "chaperone_last_name", "created_at", "email", "home_phone", "parent_first_name", "parent_last_name", "signature", "updated_at", "work_phone") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11) RETURNING "id"
INSERT INTO "registrations" ("conduct_code", "created_at", "family_id", "field_trip_form", "pp_child_num", "pp_member_num", "pp_nomember_num", "registration_num", "tshirt_num", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10) RETURNING "id"
---
  def create
  #Storing values for new Family information
    @new_family = Family.new
    @new_family.parent_first_name        = params[:parent_first_name]
    @new_family.parent_last_name         = params[:parent_last_name]
    @new_family.chaperone_first_name     = params[:chaperone_first_name]
    @new_family.chaperone_last_name      = params[:chaperone_last_name]
    @new_family.home_phone               = params[:home_phone]
    @new_family.cell_phone               = params[:cell_phone]
    @new_family.work_phone               = params[:work_phone]
    @new_family.email                    = params[:email]
    @new_family.signature                = (params[:signature] == "on")


  #Testing validations to see if new Family record will save
    if @new_family.save

      #Creating Registrations for new Family if new Family successfully saves
        registrations                    = Registration.new
        registrations.registration_num   = 0
        registrations.tshirt_num         = 0
        registrations.pp_member_num      = 0
        registrations.pp_nonmember_num   = 0
        registrations.pp_child_num       = 0
        registrations.conduct_code       = false
        registrations.field_trip_form    = false
        registrations.family_id          = @new_family.id
        registrations.save

SELECT "families".* FROM "families" WHERE "families"."id" = 3 LIMIT 1
---
  def edit
    @show_family = Family.where({ :id => params[:id] }).first

SELECT "families".* FROM "families" WHERE "families"."id" = 11 LIMIT 1
UPDATE "families" SET "chaperone_first_name" = 'x', "chaperone_last_name" = 'x', "home_phone" = 'xx', "cell_phone" = 'x', "work_phone" = 'xx', "email" = 'xxxx', "updated_at" = '2013-03-21 16:02:09.096601' WHERE "families"."id" = 3
UPDATE "registrations" SET "registration_num" = 10, "tshirt_num" = 11, "pp_member_num" = 12, "pp_nomember_num" = 13, "pp_child_num" = 14, "conduct_code" = 't', "field_trip_form" = 't', "updated_at" = '2013-03-22 21:08:16.739910' WHERE "registrations"."id" = 3
---
  def update

  #Editing any changes to Family information
    @show_family = Family.where({ :id => params[:id] }).first
    @show_family.parent_first_name        = params[:parent_first_name]
    @show_family.parent_last_name         = params[:parent_last_name]
    @show_family.chaperone_first_name     = params[:chaperone_first_name]
    @show_family.chaperone_last_name      = params[:chaperone_last_name]
    @show_family.home_phone               = params[:home_phone]
    @show_family.cell_phone               = params[:cell_phone]
    @show_family.work_phone               = params[:work_phone]
    @show_family.email                    = params[:email]
    @show_family.signature                = (params[:signature] == "on")

  #Saving Registrations input by user
    @show_family.registration.registration_num   = params[:registration_num]
    @show_family.registration.tshirt_num         = params[:tshirt_num]
    @show_family.registration.pp_member_num      = params[:pp_member_num]
    @show_family.registration.pp_nonmember_num    = params[:pp_nonmember_num]
    @show_family.registration.pp_child_num       = params[:pp_child_num]
    @show_family.registration.conduct_code       = (params[:conduct_code] == "on")
    @show_family.registration.field_trip_form    = (params[:field_trip_form] == "on")
    @show_family.registration.family_id          = params[:id]


    if @show_family.save

SELECT "students".* FROM "students" WHERE "students"."family_id" = 3
DELETE FROM "students" WHERE "students"."id" = $1  [["id", 4]]
SELECT "registrations".* FROM "registrations" WHERE "registrations"."family_id" = 3 LIMIT 1
DELETE FROM "families" WHERE "families"."id" = $1  [["id", 3]]
DELETE FROM "registrations" WHERE "registrations"."id" = $1  [["id", 3]]
SELECT "families".* FROM "families" WHERE "families"."id" = 3 LIMIT 1
---
  def destroy
  #Deleting Family record and associated Student and Registration records
    if delete_students = Student.where({ :family_id => params[:id] })
      for delete_student in delete_students
        delete_student.destroy
      end
    end

    if delete_registration = Registration.where({ :family_id => params[:id] }).first
      delete_registration.destroy
    end

    delete_family = Family.where({ :id => params[:id] }).first